In [122]:
import pandas as pd
df = pd.read_csv('/content/drive/MyDrive/datasets_projeto_DIO/Gapminder.csv', error_bad_lines=False, sep=';')
df.rename(columns={'country': 'País', 'continent': 'Continente', 'year': 'Ano', 'lifeExp': 'Expectativa de vida', 'pop': 'População', 'gdpPercap': 'PIB per capta'}, inplace=True)

In [123]:
#Mostrar as 5 primeiras linhas do dataframe:
df.head()

          País Continente   Ano  Expectativa de vida  População  PIB per capta
0  Afghanistan       Asia  1952               28.801    8425333     779.445314
1  Afghanistan       Asia  1957               30.332    9240934     820.853030
2  Afghanistan       Asia  1962               31.997   10267083     853.100710
3  Afghanistan       Asia  1967               34.020   11537966     836.197138
4  Afghanistan       Asia  1972               36.088   13079460     739.981106

In [124]:
#Mostras as n primeiras linhas de um dataframe, onde n é passado como parâmetro para a função head():
#Para n = 15:
df.head(15)

           País Continente   Ano  Expectativa de vida  População  PIB per capta
0   Afghanistan       Asia  1952               28.801    8425333     779.445314
1   Afghanistan       Asia  1957               30.332    9240934     820.853030
2   Afghanistan       Asia  1962               31.997   10267083     853.100710
3   Afghanistan       Asia  1967               34.020   11537966     836.197138
4   Afghanistan       Asia  1972               36.088   13079460     739.981106
5   Afghanistan       Asia  1977               38.438   14880372     786.113360
6   Afghanistan       Asia  1982               39.854   12881816     978.011439
7   Afghanistan       Asia  1987               40.822   13867957     852.395945
8   Afghanistan       Asia  1992               41.674   16317921     649.341395
9   Afghanistan       Asia  1997               41.763   22227415     635.341351
10  Afghanistan       Asia  2002               42.129   25268405     726.734055
11  Afghanistan       Asia  2007               43.828   31889923     974.580338
12      Albania     Europe  1952               55.230    1282697    1601.056136
13      Albania     Europe  1957               59.280    1476505    1942.284244
14      Albania     Europe  1962               64.820    1728137    2312.888958

In [125]:
#Exibir as 5 últimas linhas do dataframe:
df.tail()

          País Continente   Ano  Expectativa de vida  População  PIB per capta
3307  Zimbabwe     Africa  1987               62.351    9216418     706.157306
3308  Zimbabwe     Africa  1992               60.377   10704340     693.420786
3309  Zimbabwe     Africa  1997               46.809   11404948     792.449960
3310  Zimbabwe     Africa  2002               39.989   11926563     672.038623
3311  Zimbabwe     Africa  2007               43.487   12311143     469.709298

In [126]:
#Exbir as 9 últimas linhas do dataframe:
df.tail(9)

          País Continente   Ano  Expectativa de vida  População  PIB per capta
3303  Zimbabwe     Africa  1967               53.995    4995432     569.795071
3304  Zimbabwe     Africa  1972               55.635    5861135     799.362176
3305  Zimbabwe     Africa  1977               57.674    6642107     685.587682
3306  Zimbabwe     Africa  1982               60.363    7636524     788.855041
3307  Zimbabwe     Africa  1987               62.351    9216418     706.157306
3308  Zimbabwe     Africa  1992               60.377   10704340     693.420786
3309  Zimbabwe     Africa  1997               46.809   11404948     792.449960
3310  Zimbabwe     Africa  2002               39.989   11926563     672.038623
3311  Zimbabwe     Africa  2007               43.487   12311143     469.709298

In [127]:
#Filtro:
oceania = df.loc[df.Continente == 'Oceania']
oceania

                 País Continente  ...  População  PIB per capta
975              Fiji    Oceania  ...     421869    2039.393277
976              Fiji    Oceania  ...     485000    2170.073285
977              Fiji    Oceania  ...     544000    2797.759484
978              Fiji    Oceania  ...     599339    3182.569600
979              Fiji    Oceania  ...     658906    3209.257468
...               ...        ...  ...        ...            ...
2696  Solomon Islands    Oceania  ...     300694    1783.648762
2697  Solomon Islands    Oceania  ...     358713    2109.894257
2698  Solomon Islands    Oceania  ...     424265    2252.491044
2699  Solomon Islands    Oceania  ...     494786    1530.496068
2700  Solomon Islands    Oceania  ...     566842    1829.317402

[74 rows x 6 columns]

In [128]:
#Exibir as dimensões do dataframe:
df.shape #894 linha e 5 colunas

(3312, 6)

In [129]:
#Groupby:
print('Número de países por continente:')
df.groupby('Continente')['País'].nunique()

Número de países por continente:

Continente
Africa      51
Americas    25
Asia        41
Europe      35
FSU          6
Oceania      3
Name: País, dtype: int64

In [130]:
#Espectativa de vida média para cada país da base de dados:
print('Espectativa de vida média para cada país:')
df.groupby('Ano')['Expectativa de vida'].mean()

Espectativa de vida média para cada país:

Ano
1950    62.002568
1951    65.904167
1952    49.206867
1953    66.674563
1954    67.459817
1955    67.806757
1956    67.950637
1957    51.614590
1958    68.815936
1959    68.226579
1960    68.470837
1961    68.862480
1962    54.035234
1963    69.595735
1964    70.063105
1965    70.259881
1966    70.447526
1967    56.263629
1968    70.689081
1969    70.653896
1970    70.961141
1971    71.103976
1972    58.474481
1973    71.500338
1974    71.778504
1975    71.939218
1976    72.158050
1977    60.429090
1978    72.717567
1979    73.018717
1980    73.064524
1981    73.337399
1982    62.365871
1983    73.787778
1984    74.100741
1985    74.112222
1986    74.452222
1987    63.984860
1988    74.760000
1989    74.924444
1990    74.283437
1991    74.374848
1992    65.008443
1993    74.324545
1994    74.456667
1995    74.552727
1996    75.029394
1997    65.873799
1998    75.569697
1999    75.703636
2000    76.026364
2001    76.257879
2002    66.835695
2003    76.586667
2004    76.921563
2005    76.718667
2006    77.887778
2007    67.868557
Name: Expectativa de vida, dtype: float64

In [131]:
#Para arquivos do Excel:
df1 = pd.read_excel('/content/drive/MyDrive/datasets_projeto_DIO/Aracaju.xlsx')
df2 = pd.read_excel('/content/drive/MyDrive/datasets_projeto_DIO/Fortaleza.xlsx')
df3 = pd.read_excel('/content/drive/MyDrive/datasets_projeto_DIO/Natal.xlsx')
df4 = pd.read_excel('/content/drive/MyDrive/datasets_projeto_DIO/Recife.xlsx')
df5 = pd.read_excel('/content/drive/MyDrive/datasets_projeto_DIO/Salvador.xlsx')

In [132]:
df = pd.concat([df1, df2, df3, df4, df5])
df

       Cidade       Data  Vendas  LojaID  Qtde
0     Aracaju 2018-01-01  142.00    1520     1
1     Aracaju 2018-01-01   14.21    1522     6
2     Aracaju 2018-01-01   71.55    1520     1
3     Aracaju 2018-01-01    3.01    1521     7
4     Aracaju 2018-01-01   24.51    1522     8
..        ...        ...     ...     ...   ...
235  Salvador 2019-01-03   41.84    1034     1
236  Salvador 2019-01-03  126.29    1035     3
237  Salvador 2019-01-03   38.06    1036     3
238  Salvador 2019-01-03  139.64    1035     1
239  Salvador 2019-01-03  161.41    1037     3

[894 rows x 5 columns]

In [133]:
#Pegar uma amostra aleatória de n elementos do dataframe:
#Para n = 20:
df.sample(20)

        Cidade       Data  Vendas  LojaID  Qtde
68     Aracaju 2018-01-01  179.74    1520     2
46     Aracaju 2018-01-01   41.42    1522     2
102  Fortaleza 2019-01-01   13.99    1004     3
130     Recife 2019-03-02   12.36     983     4
213      Natal 2019-01-02   42.12    1035     1
56   Fortaleza 2019-01-01   18.43    1002     1
55       Natal 2019-01-08  859.00     854     4
189      Natal 2019-01-02  139.73    1037     2
102     Recife 2019-01-01   96.50     982     7
87       Natal 2019-01-02  135.19    1034     2
122     Recife 2019-03-02  235.06     983     3
70   Fortaleza 2019-01-01   79.57    1002     5
34      Recife 2019-01-01   24.97     980     5
209      Natal 2019-01-02   69.98    1034     2
114    Aracaju 2018-01-01   10.17    1520     5
113      Natal 2019-01-02   18.90    1034     3
61      Recife 2019-01-01  127.85     982     7
45   Fortaleza 2019-01-01   39.63    1004     3
153   Salvador 2019-01-02   17.41    1035     2
121    Aracaju 2018-01-01  162.07    1520     3

In [134]:
df.dtypes

Cidade            object
Data      datetime64[ns]
Vendas           float64
LojaID             int64
Qtde               int64
dtype: object

In [135]:
df.LojaID = df.LojaID.astype('object')
df.dtypes

Cidade            object
Data      datetime64[ns]
Vendas           float64
LojaID            object
Qtde               int64
dtype: object

In [136]:
#Verificação de valores nulos por coluna:
df.isnull().sum()

Cidade    0
Data      0
Vendas    0
LojaID    0
Qtde      0
dtype: int64

In [137]:
#Subustituição de valores nulos:
#df.fillna(selecao_coluna e atribuicao_valor, inplace=True)

In [138]:
#Apagar todas as linhas que contenham valores nulos em pelo menos uma coluna do dataframe:
df.dropna(inplace=True)

In [139]:
#Apagar todas as linhas com valores nulos de uma coluna específica:
#df.dropna(subset=['nome_da_coluna'], inplace=True)
df.dropna(subset=['Vendas'], inplace=True)

In [140]:
#Apagar linhas que apresentam valores nulos para todas as colunas - apaga a linha na qual todos os valores são nulos
df.dropna(how='all', inplace=True)

In [141]:
#Criação de uma nova coluna no dataframe:
#df['nome_nova_coluna'] = definição_genérica_do_valor_de_cada_linha ou
df['Receita'] = df.Vendas.mul(df.Qtde)
df

       Cidade       Data  Vendas LojaID  Qtde  Receita
0     Aracaju 2018-01-01  142.00   1520     1   142.00
1     Aracaju 2018-01-01   14.21   1522     6    85.26
2     Aracaju 2018-01-01   71.55   1520     1    71.55
3     Aracaju 2018-01-01    3.01   1521     7    21.07
4     Aracaju 2018-01-01   24.51   1522     8   196.08
..        ...        ...     ...    ...   ...      ...
235  Salvador 2019-01-03   41.84   1034     1    41.84
236  Salvador 2019-01-03  126.29   1035     3   378.87
237  Salvador 2019-01-03   38.06   1036     3   114.18
238  Salvador 2019-01-03  139.64   1035     1   139.64
239  Salvador 2019-01-03  161.41   1037     3   484.23

[894 rows x 6 columns]

In [142]:
#Maior elemeneto de uma coluna:
#df['nome_coluna'].max() ou
#df.nome_coluna.max()

#Maior receita do dataframe:
df.Receita.max()

3544.0

In [143]:
#Menor elemeneto de uma coluna:
#df['nome_coluna'].min() ou
#df.nome_coluna.min()

#Menor receita do dataframe:
df.Receita.min()

3.34

In [144]:
#Exibir as n linhas com os maiores valores de uma coluna:
#df.nlargest(n, nome_coluna)
df.nlargest(3, 'Receita')

   Cidade       Data  Vendas LojaID  Qtde  Receita
7   Natal 2019-03-18   886.0    853     4   3544.0
51  Natal 2018-01-21   859.0    852     4   3436.0
55  Natal 2019-01-08   859.0    854     4   3436.0

In [145]:
#Exibir as n linhas com os menores valores de uma coluna:
#df.nsmallest(n, nome_coluna)
df.nsmallest(3, 'Receita')

      Cidade       Data  Vendas LojaID  Qtde  Receita
118  Aracaju 2018-01-01    3.34   1522     1     3.34
65    Recife 2019-01-01    4.01    981     1     4.01
92     Natal 2019-01-02    4.57   1035     1     4.57

In [146]:
#Agrupamento da receita por cidade:
df.groupby('Cidade').Receita.sum()

Cidade
Aracaju       48748.25
Fortaleza     37913.97
Natal        167227.52
Recife        51936.51
Salvador      40596.73
Name: Receita, dtype: float64

In [147]:
#Ordenação de valores:
#df.sort_values('nome_coluna', ascending=[True | False]) #se ascending=True: ordem crescente; se ascending=False: ordem decrescente
df.sort_values('Receita', ascending=False).head()

   Cidade       Data  Vendas LojaID  Qtde  Receita
7   Natal 2019-03-18   886.0    853     4   3544.0
55  Natal 2019-01-08   859.0    854     4   3436.0
51  Natal 2018-01-21   859.0    852     4   3436.0
30  Natal 2018-10-02   856.0    853     4   3424.0
41  Natal 2018-05-20   835.0    852     4   3340.0

In [148]:
df.dtypes

Cidade             object
Data       datetime64[ns]
Vendas            float64
LojaID             object
Qtde                int64
Receita           float64
dtype: object

In [149]:
#Transformar a data para inteiro:
df.Data = df.Data.astype('int64')
df.dtypes

Cidade      object
Data         int64
Vendas     float64
LojaID      object
Qtde         int64
Receita    float64
dtype: object

In [150]:
#Transformar a data para datetime:
#Funçao to_datetime():
#df.nome_coluna = pd.todatetime()
df.Data = pd.to_datetime(df.Data)
df.dtypes

Cidade             object
Data       datetime64[ns]
Vendas            float64
LojaID             object
Qtde                int64
Receita           float64
dtype: object

In [151]:
#Agrupamento da receita por ano:
#Atributos dt.year:
#df.coluna_data.dt.year
df.groupby(df.Data.dt.year)['Receita'].sum()

Data
2018    118176.53
2019    228246.45
Name: Receita, dtype: float64

In [153]:
#Criação de uma coluna com os respectivos anos:
df['Ano'] = df.Data.dt.year
df

       Cidade       Data  Vendas LojaID  Qtde  Receita   Ano
0     Aracaju 2018-01-01  142.00   1520     1   142.00  2018
1     Aracaju 2018-01-01   14.21   1522     6    85.26  2018
2     Aracaju 2018-01-01   71.55   1520     1    71.55  2018
3     Aracaju 2018-01-01    3.01   1521     7    21.07  2018
4     Aracaju 2018-01-01   24.51   1522     8   196.08  2018
..        ...        ...     ...    ...   ...      ...   ...
235  Salvador 2019-01-03   41.84   1034     1    41.84  2019
236  Salvador 2019-01-03  126.29   1035     3   378.87  2019
237  Salvador 2019-01-03   38.06   1036     3   114.18  2019
238  Salvador 2019-01-03  139.64   1035     1   139.64  2019
239  Salvador 2019-01-03  161.41   1037     3   484.23  2019

[894 rows x 7 columns]